{
  "_name_or_path": "/data/leuven/328/vsc32800/electra/texts/models/electra-grc-2",
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "embedding_size": 128,
  "generator_size": "0.25",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "acc",
    "1": "dat",
    "2": "gen",
    "3": "nom",
    "4": "none",
    "5": "voc",
    "6": "_"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "acc": 0,
    "dat": 1,
    "gen": 2,
    "nom": 3,
    "none": 4,
    "voc": 5,
    "_": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "transformers_version": "4.6.0",
  "type_vocab_size": 2,
  "vocab_size": 32000
}
