{
  "_name_or_path": "/data/leuven/328/vsc32800/electra/texts/models/electra-grc-2",
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "embedding_size": 128,
  "generator_size": "0.25",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "aor",
    "1": "fut",
    "2": "futpf",
    "3": "impf",
    "4": "pf",
    "5": "plupf",
    "6": "pres",
    "7": "_"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "aor": 0,
    "fut": 1,
    "futpf": 2,
    "impf": 3,
    "pf": 4,
    "plupf": 5,
    "pres": 6,
    "_": 7
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "transformers_version": "4.6.0",
  "type_vocab_size": 2,
  "vocab_size": 32000
}
