{
  "_name_or_path": "../texts/models/electra-grc-2",
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "embedding_size": 128,
  "generator_size": "0.25",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "GAP",
    "1": "PUNCT",
    "2": "adjective",
    "3": "adverb",
    "4": "article",
    "5": "conjunction",
    "6": "coordinator",
    "7": "demonstrative",
    "8": "verb",
    "9": "indefinite",
    "10": "infinitive",
    "11": "interjection",
    "12": "interrogative",
    "13": "noun",
    "14": "numeral",
    "15": "participle",
    "16": "particle",
    "17": "personal",
    "18": "preposition",
    "19": "relative"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "GAP": 0,
    "PUNCT": 1,
    "infinitive": 10,
    "interjection": 11,
    "interrogative": 12,
    "noun": 13,
    "numeral": 14,
    "participle": 15,
    "particle": 16,
    "personal": 17,
    "preposition": 18,
    "relative": 19,
    "adjective": 2,
    "adverb": 3,
    "article": 4,
    "conjunction": 5,
    "coordinator": 6,
    "demonstrative": 7,
    "verb": 8,
    "indefinite": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "transformers_version": "4.6.0",
  "type_vocab_size": 2,
  "vocab_size": 32000
}
